[{"Title":".NET TDD Immersion (Tuesday Half Day PM)","Abstract":"TDD Immersion covers everything you need to know to do test-driven development on real .NET projects. We'll go over stuff like how to write tests first, how to refactor your code to make it easier to test, mocking frameworks like Moq, dependency injection with StructureMap, and other TDD tips and tricks I've learned from doing TDD over the years.\r\n\r\nWe'll also walk through a sample ASP.NET MVC web app and show you how you might set up an actual project, work with ORMs and data access layers, set up your test projects, and make things easy to test.  We'll end with some TDD practice to help you hone your TDD skills, so bring your laptop (or pair up with someone who has one). TDD has revolutionized the way that I write code and it can do the same for you! \r\n","Start":"2013-01-08T21:30:00Z","End":"2013-01-09T01:30:00Z","Difficulty":"Intermediate","SpeakerName":"Jon Kruger","Technology":".NET","URI":"/api/sessions.jsonp/NET-TDD-Immersion-Tuesday-Half-Day-PM","EventType":"PreCompiler","SessionLookupId":"NET-TDD-Immersion-Tuesday-Half-Day-PM","SpeakerURI":"/api/speakers.jsonp/Jon-Kruger"},{"Title":"“Users are Losers! They’ll Like Whatever we Make” and Other Fallacies. ","Abstract":"If this sounds familiar it is time to make big changes or look for a new job. Failing your users will only end badly. In this session we’ll look at the assumptions that are all-too-often made about users, usability and the User Experience (UX). In response to each of these misguided statements Carol will provide a quick method you can conduct with little or no resources to debunk these myths. ","Difficulty":"Beginner","SpeakerName":"Carol J. Smith","Technology":"Design/UX","URI":"/api/sessions.jsonp/Users-are-Losers-Theyll-Like-Whatever-we-Make-and-Other-Fallacies-","SessionLookupId":"Users-are-Losers-Theyll-Like-Whatever-we-Make-and-Other-Fallacies-","SpeakerURI":"/api/speakers.jsonp/Carol-J-Smith"},{"Title":"A Practical Guide to CSS3","Abstract":"Modern web applications push the envelope toward feeling more and more \"native\", and today many developers are taking a single-page approach to building complex apps.  As our interactions become more complicated so do our styling requirements.  Animations, transitions, highly stylized elements, web fonts, responsive layouts all add to the complexity of our projects.  In this talk, JC will help untangle some of the features of CSS3 that we can use today.  He'll show us some helpful tools like SASS and Bourbon for helping to better organize our styling while maintaining cross-browser compatibility.\r\n\r\nThis talk will focus on:\r\n\r\n- CSS3 animations and transitions\r\n- Advanced layout with CSS3 Flex-box\r\n- Element styling (shadows, border radius, multiple backgrounds, gradients, etc)\r\n- Typography, web fonts and icon fonts\r\n- Using media queries\r\n- An introduction to SASS and the Bourbon library","Difficulty":"Intermediate","SpeakerName":"JC Grubbs","Technology":"Design/UX","URI":"/api/sessions.jsonp/A-Practical-Guide-to-CSS3","SessionLookupId":"A-Practical-Guide-to-CSS3","SpeakerURI":"/api/speakers.jsonp/JC-Grubbs"},{"Title":"Active Record: Soup to Nuts (Tuesday Half Day AM)","Abstract":"The Active Record pattern, in it’s simplest form, combines data access and domain logic into a single object. In its arguably most complex form, it is the ActiveRecord gem in Ruby On Rails.\r\n\r\nDevelopers are initially drawn to the seemingly magical power of ActiveRecord as non-existent methods appear out of thin air and object relationships are established with simple declarations. Yet, the magic quickly fades as the domain models grow ever more complex and developers are faced with tougher questions. How do we model multiple levels of inheritance in our domain model? How do I ensure these methods participate in the same transaction? How (and why) do we perform a left outer join on a cross reference table without killing kittens? With the great power of ActiveRecord also comes great responsibility to understand its inner workings and, in doing so, more effectively leverage that power.\r\n\r\nThis session will provide a brief introduction to the Active Record pattern and it’s common Object Relational Mapping usage so that those who are new to Rails can quickly become productive with the tool. We will progress quickly into more extensive topics within ActiveRecord such as scopes, lifecycle callbacks, advanced queries, and modeling ugly domains. The final push of the session will focus largely on how to maintain a healthy, SOLID domain models even as the conventions of ActiveRecord lead you toward FAT, difficult to maintain domain objects. We will also discuss any obscure usage patterns that the audience may have.\r\n\r\nExpect to be coding on Rails 3 as a part of this session; we will have a virtual machine image or two for you to make use of but it’s best to come prepared with an environment (or a friend with an environment) that is ready to develop.\r\n","Start":"2013-01-08T13:30:00Z","End":"2013-01-08T18:30:00Z","Difficulty":"Intermediate","SpeakerName":"Todd Kaufman","Technology":"Ruby","URI":"/api/sessions.jsonp/Active-Record-Soup-to-Nuts-Tuesday-Half-Day-AM","EventType":"PreCompiler","SecondarySpeakerName":"Jason Karns","SecondarySpeakerBio":"Jason Karns is a bit of a code nomad, having called PHP, .NET, Java and now Ruby his home. A common thread across all platforms is his passion for well-crafted software and enjoyment in web application development. Jason is still searching for a way to combine programming and golf into the epitome of activities. In his free time, Jason ships software through Test Double from Columbus, Ohio.","SessionLookupId":"Active-Record-Soup-to-Nuts-Tuesday-Half-Day-AM","SpeakerURI":"/api/speakers.jsonp/Todd-Kaufman"},{"Title":"Advanced ASP.NET MVC","Abstract":"In this session we will look at different techniques that leverage extensibility points within ASP.NET MVC to make the most of your applications.  If you've ever wanted to know how you can do more with less within MVC, this is a session you don't want to miss!","Difficulty":"Advanced","SpeakerName":"Javier Lozano","Technology":".NET","URI":"/api/sessions.jsonp/Advanced-ASPNET-MVC","SessionLookupId":"Advanced-ASPNET-MVC","SpeakerURI":"/api/speakers.jsonp/Javier-Lozano"},{"Title":"Advanced Unit Testing Design and How it Applies to Stakeholders","Abstract":"Automated testing provides a way for developers to validate a certain level of quality. But, automated testing provides much, much more than that. Automated tests form the basis of many types of documentation, if you let them.\r\n\r\nThis session details how you can build on your automated testing successes by detailing how organize and name your test classes and test methods to make your tests work for you. Your tests can be the reference documentation for your internal APIs. Tests can validate code but they can also validate requirements and acceptance criteria. When tests are well organized, they can be used to round-trip requirements and acceptance criteria to give stakeholders full round-trip validation by generating human-readable documentation based on certain tests. This session also details ways to reflect certain types of tests to document how tests are validating requirements and acceptance criteria.","Difficulty":"Advanced","SpeakerName":"Peter Ritchie","Technology":"Testing","URI":"/api/sessions.jsonp/Advanced-Unit-Testing-Design-and-How-it-Applies-to-Stakeholders","SessionLookupId":"Advanced-Unit-Testing-Design-and-How-it-Applies-to-Stakeholders","SpeakerURI":"/api/speakers.jsonp/Peter-Ritchie"},{"Title":"Agile Servant Leadership practices with Moral Authority: WOOF","Abstract":"This interactive session will share emerging Lean & Agile leadership techniques for management that we practice to support servant leadership.  We will share decision making techniques such as Fist of Five, 6 Thinking Hats.  We will also show collaboration techniques such as Collaboration 8, Program Alignment Walls, Key Performance Indicators, Sales Alignment Wall, Lady Bugs and discuss how to lead with Moral Authority.  ","Difficulty":"Beginner","SpeakerName":"Jon Stahl","Technology":"Agile","URI":"/api/sessions.jsonp/Agile-Servant-Leadership-practices-with-Moral-Authority-WOOF","SecondarySpeakerName":"Michael \"Doc\" Norton","SecondarySpeakerBio":"A promoter and practitioner of agile since 1999, Michael “Doc” Norton is an agile coach and a partner with LeanDog. Doc's twenty-plus years of software development have provided him with experience on a wide range of topics. As a member of LeanDog, living in Wadsworth, OH, Doc provides coaching, mentoring, training, and delivery in agile/XP/lean software development techniques. Doc is immediately suspicious of anyone who declares expertise in a single programming language or methodology. He is passionate about helping others become better developers, working with teams to improve delivery, and emphasizing software craftsmanship.\r\n","SessionLookupId":"Agile-Servant-Leadership-practices-with-Moral-Authority-WOOF","SpeakerURI":"/api/speakers.jsonp/Jon-Stahl"}]